Repository: pavellunev/trading_chart
Catalog: Sources/TradingChart/Resources/TradingChart.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, id, it, nl, pt_br, ru, tr, vi, zh_hans

# badge.scrollToLatest
source: Scroll to latest
ar: الانتقال إلى الأحدث
de: Zum Neuesten scrollen
es: Ir a lo más reciente
fr: Aller au plus récent
hi: नवीनतम पर जाएँ
id: Gulir ke terbaru
it: Vai all'ultimo
nl: Naar nieuwste scrollen
pt_br: Ir para o mais recente
ru: К текущей цене
tr: En yeniye git
vi: Cuộn đến mới nhất
zh_hans: 回到最新

# chart.action.showEarlierBars
source: Show earlier bars
ar: عرض نقاط البيانات السابقة
de: Frühere Balken anzeigen
es: Mostrar barras anteriores
fr: Afficher les barres précédentes
hi: पहले के बार दिखाएँ
id: Tampilkan bar sebelumnya
it: Mostra barre precedenti
nl: Eerdere balken tonen
pt_br: Mostrar barras anteriores
ru: Показать предыдущие бары
tr: Önceki çubukları göster
vi: Hiện các thanh trước
zh_hans: 显示更早的数据点

# chart.action.showLaterBars
source: Show later bars
ar: عرض نقاط البيانات اللاحقة
de: Spätere Balken anzeigen
es: Mostrar barras posteriores
fr: Afficher les barres suivantes
hi: बाद के बार दिखाएँ
id: Tampilkan bar berikutnya
it: Mostra barre successive
nl: Latere balken tonen
pt_br: Mostrar barras posteriores
ru: Показать следующие бары
tr: Sonraki çubukları göster
vi: Hiện các thanh sau
zh_hans: 显示更晚的数据点

# chart.action.showLatestBar
source: Show latest bar
ar: عرض أحدث نقطة بيانات
de: Neuesten Balken anzeigen
es: Mostrar la barra más reciente
fr: Afficher la dernière barre
hi: नवीनतम बार दिखाएँ
id: Tampilkan bar terbaru
it: Mostra l'ultima barra
nl: Nieuwste balk tonen
pt_br: Mostrar a barra mais recente
ru: Показать последний бар
tr: En yeni çubuğu göster
vi: Hiện thanh mới nhất
zh_hans: 显示最新数据点

# chart.area
source: Area chart
ar: مخطط مساحي
de: Flächendiagramm
es: Gráfico de áreas
fr: Graphique en aires
hi: एरिया चार्ट
id: Grafik area
it: Grafico ad area
nl: Vlakgrafiek
pt_br: Gráfico de área
ru: График с заливкой
tr: Alan grafiği
vi: Biểu đồ vùng
zh_hans: 面积图

# chart.atLatestBar
source: At the latest bar
ar: عند أحدث نقطة بيانات
de: Am neuesten Balken
es: En la barra más reciente
fr: À la barre la plus récente
hi: सबसे नए बार पर
id: Di bar terbaru
it: All'ultima barra
nl: Bij de nieuwste balk
pt_br: Na barra mais recente
ru: На последнем баре
tr: En yeni çubukta
vi: Ở thanh mới nhất
zh_hans: 位于最新数据点

# chart.atStartOfHistory
source: At the start of the loaded history
ar: في بداية السجل المحمّل
de: Am Anfang des geladenen Verlaufs
es: Al inicio del historial cargado
fr: Au début de l'historique chargé
hi: लोड किए गए इतिहास की शुरुआत में
id: Di awal riwayat yang dimuat
it: All'inizio dello storico caricato
nl: Aan het begin van de geladen geschiedenis
pt_br: No início do histórico carregado
ru: В начале загруженной истории
tr: Yüklenen geçmişin başında
vi: Ở đầu lịch sử đã tải
zh_hans: 已到达已加载历史的起点

# chart.candlestick
source: Candlestick chart
ar: مخطط الشموع
de: Kerzendiagramm
es: Gráfico de velas
fr: Graphique en chandeliers
hi: कैंडलस्टिक चार्ट
id: Grafik candlestick
it: Grafico a candele
nl: Candlestick-grafiek
pt_br: Gráfico de candlestick
ru: Свечной график
tr: Mum grafiği
vi: Biểu đồ nến
zh_hans: K线图

# chart.lastPrice
source: Last price %@
ar: آخر سعر %@
de: Letzter Preis %@
es: Último precio %@
fr: Dernier prix %@
hi: अंतिम मूल्य %@
id: Harga terakhir %@
it: Ultimo prezzo %@
nl: Laatste prijs %@
pt_br: Último preço %@
ru: Последняя цена %@
tr: Son fiyat %@
vi: Giá gần nhất %@
zh_hans: 最新价 %@

# chart.line
source: Line chart
ar: مخطط خطي
de: Liniendiagramm
es: Gráfico de líneas
fr: Graphique en courbe
hi: लाइन चार्ट
id: Grafik garis
it: Grafico a linee
nl: Lijngrafiek
pt_br: Gráfico de linhas
ru: Линейный график
tr: Çizgi grafiği
vi: Biểu đồ đường
zh_hans: 折线图

# chart.scrolledIntoThePast
source: Scrolled into the past
ar: تم التمرير إلى الماضي
de: In die Vergangenheit gescrollt
es: Desplazado al pasado
fr: Défilement vers le passé
hi: पिछले समय में स्क्रॉल किया गया
id: Digulir ke masa lalu
it: Scorrimento verso il passato
nl: Teruggescrold in de tijd
pt_br: Rolado para o passado
ru: Просмотр истории
tr: Geçmişe kaydırıldı
vi: Đã cuộn về quá khứ
zh_hans: 已滚动到过去

# chart.showingRange
source: Showing %1$@ to %2$@
ar: عرض من %1$@ إلى %2$@
de: Angezeigt: %1$@ bis %2$@
es: Mostrando de %1$@ a %2$@
fr: Affichage de %1$@ à %2$@
hi: %1$@ से %2$@ तक दिखाया जा रहा है
id: Menampilkan %1$@ sampai %2$@
it: Visualizzazione da %1$@ a %2$@
nl: Weergave van %1$@ tot %2$@
pt_br: Exibindo de %1$@ a %2$@
ru: Показан период с %1$@ по %2$@
tr: %1$@ ile %2$@ arası gösteriliyor
vi: Hiển thị từ %1$@ đến %2$@
zh_hans: 显示 %1$@ 至 %2$@

# history.loading
source: Loading history
ar: جارٍ تحميل السجل
de: Verlauf wird geladen
es: Cargando historial
fr: Chargement de l'historique
hi: इतिहास लोड हो रहा है
id: Memuat riwayat
it: Caricamento dello storico
nl: Geschiedenis laden
pt_br: Carregando histórico
ru: Загрузка истории
tr: Geçmiş yükleniyor
vi: Đang tải lịch sử
zh_hans: 正在加载历史数据

# style.area
source: Area
ar: مساحة
de: Fläche
es: Área
fr: Aire
hi: एरिया
nl: Vlak
pt_br: Área
ru: Область
tr: Alan
vi: Vùng
zh_hans: 面积

# style.candles
source: Candles
ar: شموع
de: Kerzen
es: Velas
fr: Bougies
hi: कैंडल
id: Candle
it: Candele
nl: Kaarsen
ru: Свечи
tr: Mum
vi: Nến
zh_hans: K线

# style.line
source: Line
ar: خط
de: Linie
es: Línea
fr: Courbe
hi: लाइन
id: Garis
it: Linea
nl: Lijn
pt_br: Linha
ru: Линия
tr: Çizgi
vi: Đường
zh_hans: 折线

# style.picker
source: Chart style
ar: نمط المخطط
de: Diagrammstil
es: Estilo del gráfico
fr: Style du graphique
hi: चार्ट शैली
id: Gaya grafik
it: Stile del grafico
nl: Grafiekstijl
pt_br: Estilo do gráfico
ru: Стиль графика
tr: Grafik stili
vi: Kiểu biểu đồ
zh_hans: 图表样式

# tooltip.change
source: Change
ar: التغيّر
de: Änderung
es: Cambio
fr: Variation
hi: बदलाव
id: Perubahan
it: Variazione
nl: Wijziging
pt_br: Variação
ru: Изм.
tr: Değişim
vi: Thay đổi
zh_hans: 涨跌额

# tooltip.changePercent
source: Change %
ar: التغيّر %
de: Änderung %
es: Cambio %
fr: Variation %
hi: बदलाव %
id: Perubahan %
it: Variazione %
nl: Wijziging %
pt_br: Variação %
ru: Изм. %
tr: Değişim %
vi: Thay đổi %
zh_hans: 涨跌幅

# tooltip.close
source: Close
ar: الإغلاق
de: Schluss
es: Cierre
fr: Clôture
hi: बंद
id: Tutup
it: Chiusura
nl: Slot
pt_br: Fechamento
ru: Закр.
tr: Kapanış
vi: Đóng
zh_hans: 收盘

# tooltip.high
source: High
ar: الأعلى
de: Hoch
es: Máximo
fr: Haut
hi: उच्च
id: Tertinggi
it: Massimo
nl: Hoog
pt_br: Máxima
ru: Макс.
tr: Yüksek
vi: Cao
zh_hans: 最高

# tooltip.low
source: Low
ar: الأدنى
de: Tief
es: Mínimo
fr: Bas
hi: निम्न
id: Terendah
it: Minimo
nl: Laag
pt_br: Mínima
ru: Мин.
tr: Düşük
vi: Thấp
zh_hans: 最低

# tooltip.open
source: Open
ar: الافتتاح
de: Eröffnung
es: Apertura
fr: Ouverture
hi: खुला
id: Buka
it: Apertura
pt_br: Abertura
ru: Откр.
tr: Açılış
vi: Mở
zh_hans: 开盘

# tooltip.price
source: Price
ar: السعر
de: Preis
es: Precio
fr: Prix
hi: मूल्य
id: Harga
it: Prezzo
nl: Prijs
pt_br: Preço
ru: Цена
tr: Fiyat
vi: Giá
zh_hans: 价格

# tooltip.range
source: Range
ar: المدى
de: Spanne
es: Rango
fr: Amplitude
hi: रेंज
id: Rentang
it: Ampiezza
nl: Bereik
pt_br: Amplitude
ru: Амплитуда
tr: Aralık
vi: Biên độ
zh_hans: 高低差

# tooltip.time
source: Time
ar: الوقت
de: Zeit
es: Hora
fr: Heure
hi: समय
id: Waktu
it: Ora
nl: Tijd
pt_br: Hora
ru: Время
tr: Zaman
vi: Thời gian
zh_hans: 时间

# tooltip.volume
source: Volume
ar: الحجم
de: Volumen
es: Volumen
hi: वॉल्यूम
ru: Объём
tr: Hacim
vi: Khối lượng
zh_hans: 成交量
